Repository: AdithyaKrishnaK/musicblocks
Catalog: po/*.po
Languages: th

source: action
th: การกระทำ

source: Run fast
th: วิ่งเร็ว

source: Run slow
th: วิ่งช้า

source: Run step by step
th: เล่นที่ละขั้นตอน

source: Run music slow
th: เล่นเสียงดนตรี (ช้า)

source: Run note by note
th: เล่นโน้ตต่อโน้ต

source: Stop
th: หยุด

source: Clean
th: ล้าง

source: Show/hide palettes
th: แสดง/ซ่อนเมนูสี

source: Show/hide blocks
th: แสดง/ซ่อน บล๊อก

source: Expand/collapse collapsable blocks
th: เพิ่ม/พัง บล๊อกที่สามารถพังได้

source: Help
th: ช่วยเหลือ

source: Load samples from server
th: โหลดตัวอย่างจากเซอเว่อร์

source: Save project
th: บันทึกงาน

source: Save sheet music
th: บันทึกโน้ตเพลง

source: Paste
th: วาง

source: Cartesian
th: คาร์ทีเซียน

source: Polar
th: ขั้ว

source: Settings
th: ตั้งค่า

source: Delete all
th: ลบทั้งหมด

source: Undo
th: ยกเลิกคำสั่งเก่า

source: clear
th: ล้าง

source: invert
th: สับเปลี่ยนที่กัน

source: confirm
th: ยืนยัน

source: play
th: เล่น

source: rest
th: พัก

source: note value
th: ค่าของโน้ต

source: tuplet value
th: ค่าทูเปรท

source: start
th: เริ่ม

source: You must have at least one pitch block and one rhythm block in the matrix.
th: คุณควรมีอย่างน้อยหนึ่งบล๊อกระดับเสียง และหนึ่งบล๊อกจังหวะในเมทริกซ์

source: Please close the current matrix before opening a new one.
th: กรุณาปิดเมทริกซ์ปัจจุบันก่อนที่จะเปิดอันใหม่

source: Note value must be greater than 0
th: ค่าโน้ตต้องมากกว่า0

source: empty heap
th: heap ว่าง

source: start drum
th: เริ่มเสียงกลอง

source: Decrease block size
th: ลดขนาดของบล๊อก

source: Increase block size
th: ลดขนาดบล๊อก

source: Display statistics
th: แสดงสถิติ

source: Load plugin from file
th: โหลดปลั๊กอินจากไฟล์

source: Enable scrolling
th: ทำให้เลื่อนได้

source: rhythm
th: จังหวะ

source: pitch
th: ระดับเสียง

source: tone
th: โทน

source: flow
th: ความคล่องตัว

source: boxes
th: กล่อง

source: turtle
th: เต่า

source: pen
th: ปากกา

source: number
th: ตัวเลข

source: boolean
th: บูลีน

source: media
th: สื่อ

source: sensors
th: เซนเซอร์

source: heap
th: ฮีป

source: extras
th: เพิ่มเติม

source: Welcome to Music Blocks
th: ยินดีต้อนรับสู่Music Blocks

source: Music Blocks is a collection of manipulative tools for exploring fundamental musical concepts in an integrative and fun way.
th: Music Blocksคือศูนย์ร่วมอุปกรณ์ต่างๆเพื่อสำรวจแนวคิดเรื่องดนตรีด้วยวิธีที่สนุกและครบถ้วน

source: Let us start our tour!
th: Music Blocks เริ่มทัวร์กันได้เลย

source: Palette buttons
th: ปุ่มเมนูสี

source: This toolbar contains the palette buttons Matrix Notes Tone Turtle and more.
th: กล่องเครื่องมีนี้มีปุ่มพิกัด โน้ต โทนเต่า และอีกมากมาย

source: Click to show the palettes of blocks and drag blocks from the palettes onto the canvas to use them.
th: คลิ๊กเพื่อแสดงแถบสีของบล๊อกและลากบล๊อกจากแถบสีไปยังแสดงแสดงผล

source: Click to run the project in fast mode.
th: คลิ๊กเพื่อเล่นโปรเจคในโหมดเร็ว

source: Click to run the project in slow mode.
th: คลิ๊กเพื่อเล่นโปรเจคอย่างช้า

source: Click to run just the music in slow mode.
th: คลิ๊กเพื่อเล่นดนตรีในโหมดช้า

source: Click to run the project step by step.
th: คลิ๊กเพื่อให้โปรเจคเล่นทีละขั้นตอน

source: Click to run the music note by note.
th: คลิ๊กที่นี่เพื่อเล่นดนตรีโน้ตต่อโน้ต

source: Stop the music (and the turtles).
th: หยุดเพลง (และเต่า)

source: Clear the screen and return the turtles to their initial positions.
th: ลบจอทั้งหมด และให้เต่าไปอยู่ที่จุดตั้งต้น

source: Hide or show the block palettes.
th: ซ้อนหรือแสดงบล๊อก

source: Hide or show the blocks and the palettes.
th: ซ่อนหรือแสดงบล๊อกและเมนูสี

source: Expand or collapse start and action stacks.
th: ขยายหรือล้ม เริ่มและเรียงทับกัน

source: Show these messages.
th: แสดงข้อความ

source: Expand/collapse option toolbar
th: เพิ่ม/ลด แถบเครื่องมือตัวเลือก

source: Click this button to expand or collapse the auxillary toolbar.
th: กดปุ่มนี้เพื่อขยายหรือลดกล่องเครื่องมือเพิ่มเติม

source: This button opens a viewer for loading example projects.
th: ปุ่มนี้เปิดหน้าต่างเพื่อโหลดโปรเจคตัวอย่าง

source: You can also load projects from the file system.
th: คุณสามารถโหลดโปรเจคได้จากไฟล์ในโปรแกรม

source: Save your project to a file.
th: บันทึกโปรเจคของคุณเป็นไฟล์

source: Save your project to as a Lilypond file.
th: บันทึกไฟล์เป็นไฟล์Lilypond

source: Copy
th: คัดลอก

source: The paste button is enabled when there are blocks copied onto the clipboard.
th: จะใช้ปุ่มวางได้ต่อเมื่อ คุณคัดลอกบล๊อกไว้บนคลิปบอร์ด

source: Save stack
th: บันทึก

source: Show or hide a Cartesian-coordinate grid.
th: แสดงหรือซ้อนกราฟพิกัดคาร์ทีเซียน

source: Show or hide a polar-coordinate grid.
th: แสดง หรือซ่อนกราฟ พิกัดเชิงขั้ว

source: Open a panel for configuring Music Blocks.
th: เปิดแผงสำหรับปรับแต่ง Music Blocks

source: Decrease the size of the blocks.
th: ลดขนาดของบล๊อก

source: Increase the size of the blocks.
th: เพิ่มขนาดของบล๊อก

source: Display statistics about your Music project.
th: แสดงสถิตของโปรเจคคุณ

source: You can load new blocks from the file system.
th: คุณสามารถโหลดบล๊อกใหม่จากไฟล์ในเครือข่าย

source: You can scroll the blocks on the canvas.
th: คุณสามารถเลื่อนบล๊อกสู่แคนวาส

source: Remove all content on the canvas, including the blocks.
th: ลบทุกอย่าง รวมทั้งบล๊อก

source: Restore blocks from the trash.
th: กู้บล๊อกจากถังขยะ

source: Congratulations.
th: ยินดีด้วย

source: You have finished the tour. Please enjoy Music Blocks!
th: ทัวร์จบแล้ว เริ่มเล่น Music Blockกัน

source: Open
th: เปิด

source: Delete
th: ลบ

source: Publish
th: โพสสู่สาธารณะ

source: Download
th: ดาวน์โหลด

source: Planet
th: ดาวเคราะห์

source: On my device
th: บนเครื่องของฉัน

source: Worldwide
th: ทั่วโลก

source: open file
th: เปิดไฟล์

source: text
th: ถ้ดไป

source: box
th: กล่อง

source: store in
th: นำไปเก็บไว้

source: name
th: ชื่อ

source: value
th: ค่า

source: back
th: กลับ

source: hide
th: ซ่อน

source: show
th: แสดง

source: popout
th: หน้าต่างแจ้งเตือน

source: sine
th: ซายน์

source: note
th: โน้ต

source: current pitch name
th: ชื่อระดับเสียงปัจจุบัน

source: current pitch octave
th: เสียงโน้ตคู่แปด

source: square
th: สี่เหลี่ยม

source: triangle
th: สามเหลี่ยม

source: sawtooth
th: ฟันเลื้อย

source: transposition
th: การเปลี่ยนตำแหน่ง

source: turtle pitch number
th: จำนวนเต่าระดับเสียง

source: number to pitch
th: จำนวนจนถึงระดับเสียง

source: number to octave
th: จำนวนจนถึงโน้ตคู่แปด

source: octave
th: เสียงแปดคู่

source: adjust transposition
th: ปรับการคมนาคม

source: flat
th: ราบ

source: sharp
th: เสียงแหลม

source: 1/64 note
th: โน้ต 1/64

source: 1/32 note
th: โน๊ต 1/32

source: 1/16 note
th: โน้ต 1/16

source: eighth note
th: โน้ตแปด

source: quarter note
th: โน้ต 1/4

source: half note
th: โน๊ตครึ่ง

source: whole note
th: โน้ตเต็ม

source: tuplet
th: ทูเปรท

source: number of notes
th: จำนวนของโน้ต

source: pitch-time matrix
th: คำอธิบายเมตริกซ์ภาพ

source: duplicate factor
th: ปัจจัยคักลอก

source: skip factor
th: ปัจจัยข้าม

source: beat factor
th: ปัจจัยให้เกิดจังหวะ

source: beats per minute
th: บีทต่อนาที

source: osctime
th: เวลาจากเครื่องกำเนิดสัญญาณ

source: skip notes
th: ข้านโน้ต

source: duplicate notes
th: คัดลอกโน้ต

source: multiply beat value
th: หลายจังหวะ

source: divide beat value
th: แยกบีท

source: tie
th: รวม

source: dot
th: จุด

source: silence
th: พัก

source: set volume
th: ปรับเสียง

source: staccato factor
th: ปัจจัยstaccato

source: slur factor
th: ปัจจัยslur

source: note volume
th: เสียงของโน๊ต

source: key
th: คีย์

source: set key
th: ตั้งคีย์

source: meter
th: อัตราจังหวะ

source: numerator
th: เศษ

source: denominator
th: ส่วน

source: swing
th: แกว่ง

source: heading
th: ทิศทางปัจจุบัน

source: x
th: แกน x

source: y
th: แกน y

source: arc
th: เส้นโค้ง

source: angle
th: มุม

source: radius
th: รัศมี

source: set heading
th: กำหนดทิศทาง

source: set xy
th: ตั้งค่าแกน xy

source: right
th: ขวา

source: left
th: ซ้าย

source: forward
th: เดินหน้า

source: background
th: พื้นหลัง

source: color
th: สี

source: shade
th: เฉดสี

source: grey
th: เทา

source: pen size
th: ขนาดปากกา

source: hollow line
th: เส้นช่องโพรง

source: fill
th: เติม

source: pen up
th: ยกปากกาขึ้น

source: pen down
th: จรดปากกา

source: set pen size
th: ตั้งค่าขนาดปากกา

source: set hue
th: ตั้งค่า ความมืดหรือความสว่างของสี

source: set shade
th: ตั้งค่าเฉดสี

source: set grey
th: ตั้งเป็นสีเทา

source: set color
th: ตั้งค่าสี

source: and
th: บวก

source: or
th: หรือ

source: not
th: ไม่

source: mod
th: หารเอาเศษ

source: sqrt
th: จำนวนรากกำลังสอง

source: one of
th: หนึ่งใน

source: this
th: นี้

source: that
th: ซึ่ง

source: random
th: สุ่ม

source: min
th: นาที

source: max
th: ใหญ่สุด

source: add 1 to
th: เพิ่ม1ที่

source: add
th: เพิ่ม

source: to
th: เพิ่ม1

source: do
th: ทำ

source: on
th: ตรง

source: event
th: งาน

source: broadcast
th: ถ่ายทอด

source: set heap
th: ตั้งค่าฮีป

source: index
th: ดัชนี

source: show heap
th: แสดง heap

source: heap length
th: ความยาวของฮีป

source: heap empty?
th: ลบฮีป?

source: save heap
th: บันทึกฮีป

source: load heap
th: โหลดฮีป

source: index heap
th: ดัชนีฮีป

source: push
th: ใส่เข้าไป

source: pop
th: ป๊อบ

source: speak
th: พูด

source: stop media
th: หยุดสื่อ

source: frequency
th: ความถี่

source: duration (ms)
th: ระยะเวลาต่อ จุลวินาที

source: note to frequency
th: โน้ตความถี่

source: shell
th: กระดอง

source: size
th: ขนาด

source: image
th: รูปภาพ

source: obj
th: สิ่งของ

source: stop
th: หยุด

source: wait for
th: รอ

source: until
th: จนกว่า

source: while
th: สีขาว

source: if
th: ถ้า

source: then
th: แล้ว

source: else
th: ไม่งั้นให้ทำ

source: forever
th: ตลอดไป

source: repeat
th: ซ้ำ

source: unknown
th: ไม่รู้

source: play back
th: เล่นย้อนหลัง

source: stop play
th: หยุดเล่น

source: loudness
th: ระดับความดัง

source: save as lilypond
th: จัดเก็บเป็น lilypond

source: title
th: หัวข้อ

source: save svg
th: บันทึกโปรเจคเป็นSVG

source: turtle y
th: เต่า y

source: turtle x
th: เต่า x

source: start turtle
th: เริ่มเต่า

source: stop turtle
th: หยุดเต่า

source: no background
th: ไม่มีพื้นหลัง

source: show blocks
th: แสดง blocks

source: hide blocks
th: ซ่อน blocks

source: wait
th: รอ

source: print
th: งานพิมพ์

source: turtle name
th: ชื่อของเต่า

source: source
th: แหล่ง

source: target
th: เป้าหมาย

source: click
th: คลิ๊ก

source: pixel color
th: พิเซลของสี

source: time
th: เวลา

source: mouse x
th: หนูx

source: mouse y
th: หนูy

source: mouse button
th: ปุ่มหนู

source: keyboard
th: แป้นพิมพ์

source: eval
th: ประเมิน

source: city latitude
th: เส้นรุ้งของเมือง

source: city longitude
th: เส้นแวงของเมือง

source: Coordinate data not available.
th: ไม่มีพิกัดข้อมูล

source: Google map
th: แผนที่

source: coordinates
th: พิกัด

source: zoom factor
th: ปัจจัยที่น่าสนใจ

source: zoom
th: ขยาย

source: latitude
th: เส้นรุ่ง

source: longitude
th: เส้นแวง

source: define
th: ความหมาย

source: bitcoin
th: บิตคอย์น

source: from
th: จาก

source: power
th: ยกกำลัง

source: base
th: ฐาน

source: exp
th: เลขยกกำลังในคณิตศาสตร์

source: floor
th: พื้น

source: ceiling
th: เพดาน

source: degrees
th: ดีกรี

source: to degrees
th: ถึงดีกรีที่

source: radians
th: รัศมีเส้นโค้ง

source: to radians
th: รัศมี

source: translate
th: แปล

source: hello
th: สวัสดี

source: detect lang
th: จับภาษา

source: set lang
th: ตั้งค่าภาษา

source: move
th: ย้าย

source: sing
th: ร้อง

source: duration
th: ช่วงเวลา

source: currency
th: เงินตรา

source: stock price
th: ราคาหุ้น

source: publish
th: โพสสู่สาธารณะ

source: comment
th: หมายเหตุ

source: forecast
th: พยากรณ์

source: city
th: เมือง

source: day
th: วัน

source: high
th: สูง

source: low
th: ต่ำ

source: get calories
th: รับแคลลอรี่

source: get protein
th: รับโปรตีน

source: get carbs
th: รับ คาร์โบไฮเดรต

source: get fiber
th: รับกาก

source: get fat
th: ทำให้อ้วน

source: get name
th: รับค่าชื่อ

source: calories
th: แคลลอรี่

source: protein
th: โปรตีน

source: carbs
th: คาร์โบไฮเดรต

source: fiber
th: กาก

source: fat
th: อ้วน

source: eat
th: กิน

source: digest meal
th: ย่อยอาหาร

source: apple
th: แอปเปิ้ล

source: banana
th: กล้วย

source: orange
th: สีส้ม

source: wheat bread
th: ขนมปังข้าวสาลี

source: corn
th: ข้าวโพด

source: potato
th: มันฝรั้ง

source: sweet potato
th: มันหวาน

source: tomato
th: มะเขือเทศ

source: broccoli
th: บล๊อกโคลี่

source: rice and beans
th: ข้าวและถั่ว

source: tamale
th: เทมาเล่

source: cheese
th: ชีส

source: chicken
th: ไก่

source: fish
th: ปลา

source: beef
th: เนื้อ

source: cake
th: เค้ก

source: cookie
th: คุกกี้

source: water
th: น้ำ

source: motion x
th: การเคลื่อนไหวx

source: motion y
th: การเคลื่อนไหวy

source: motion z
th: การเคลื่อนไหวz
